import { TbCrystalBall } from "react-icons/tb";
import { PiFlowerLotus } from "react-icons/pi";
import { GiLifeInTheBalance, GiLovers, GiSemiClosedEye } from "react-icons/gi";
import { MdHistoryToggleOff } from "react-icons/md";
import { LuCalendarHeart } from "react-icons/lu";
import { GrMoney } from "react-icons/gr";
import { BsStars } from "react-icons/bs";

export const servicesData = [
  {
    id: "astro1",
    slug: "natal-chart",
    title: "Натальна астрологія",
    description: "Повний розбір дитячої та дорослої натальної карти",
    fullDescription: `
Натальна карта — це детальна карта вашої особистості, талантів, потенціалу та життєвих викликів.  
Під час розбору ви дізнаєтесь:


• ваші сильні та слабкі сторони  
• природні таланти та ресурси  
• життєву місію та головні задачі  
• психологічні особливості  
• моделі поведінки та реакцій  
• як досягти кар'єрного росту
• ключові сфери розвитку  
`,
    icon: BsStars,
  },

  {
    id: "astro2",
    slug: "financial",
    title: "Фінансова, бізнес астрологія",
    description: "Де мої гроші, як заробляти багато і з задоволенням",
    fullDescription: `
Цей аналіз допоможе зрозуміти, як вам легше й природніше заробляти гроші, де ваш фінансовий успіх.


**Ви дізнаєтесь:**  
• ваш фінансовий потенціал 
• джерела доходу, які працюють саме для вас  
• сфери і професії, де ви найпродуктивніші й найуспішніші
• як поводитися з грошима: накопичення чи інвестиції  
• як уникнути фінансових криз  
• практичні поради для зростання доходу та стабільності
`,
    icon: GrMoney,
  },

  {
    id: "astro3",
    slug: "relationships",
    title: "Сфера відносин, кохання",
    description: "Особисте життя. Пошук ідеального партнера",
    fullDescription: `
Цей розбір відкриє ваші сценарії у стосунках. 


**Ви дізнаєтесь:**  
• який партнер вам підходить  
• як побудувати  гармонійні стосунки
• де зустріти свою другу половинку  
• сексуальну сумісність та емоційні потреби 
`,
    icon: GiLovers,
  },

  {
    id: "astro4",
    slug: "karmic",
    title: "Кармічна астрологія",
    description: "Формула душі, фігури Джонса, Ліліт та Селена",
    fullDescription: `
Це глибинний духовно-психологічний розбір життєвих задач.


**Ми аналізуємо:**  
• формулу душі  
• розуміння кармічних уроків
• які сценарії ви повторюєте і чому
• задачі поточного втілення  
• Ліліт, Селену та їх вплив  
• головне призначення і шляхи його досягнення
`,
    icon: GiSemiClosedEye,
  },

  {
    id: "astro5",
    slug: "health",
    title: "Здоров'я",
    description: "Ризики та кризи. Психосоматика та рекомендації.",
    fullDescription: `
Астрологія здоров’я допомагає зрозуміти слабкі місця організму, природні ресурси відновлення та психосоматичні причини захворювань.


**Ви дізнаєтесь:**  
• аналіз фізичних вразливостей, на що варто звернути увагу в першу чергу
• генетичні та спадкові схильності
• ризики та кризи по життю 
• психосоматичні причини напруження, їх пропрацювання 
• рекомендації з харчування
`,
    icon: PiFlowerLotus,
  },

  {
    id: "astro6",
    slug: "relocation",
    title: "Релокація",
    description: "Підбір країни для проживання",
    fullDescription: `
Астрологічна релокація показує, в якій країні або місті на вас чекають кращі можливості.


**Ви дізнаєтесь:**  
• де вам буде комфортно жити  
• де найкращі фінансові можливості
• де є кар'єрний та соціальний зріст  
• де можливі любов і гармонія  
• де є можливість мінімізувати ризики та кризи
`,
    icon: GiLifeInTheBalance,
  },

  {
    id: "astro7",
    slug: "forecast",
    title: "Прогнози — зазирни в майбутнє",
    description: "Прогнози на місяць, рік. Лунар. Соляр.",
    fullDescription: `
Прогнозування допоможе спланувати, та максимально ефективно прожити період життя.


**Ви дізнаєтесь:**  
• персональні ключові тенденції та теми періоду 
• прогноз на місяць
• прогноз по сферах: фінанси, робота, навчання,стосунки
• які ключові події вас очікують найближчим часом  
• періоди можливостей та коли потрібно бути обережним  

    `,
    icon: TbCrystalBall,
  },

  {
    id: "astro8",
    slug: "elective",
    title: "Електив",
    description: "Підбір дати під важливу подію",
    fullDescription: `
Електив — це точний підбір найбільш сприятливої дати для важливої події.


**Вибираємо найкращий момент для:**  
• весілля  
• відкриття бізнесу  
• операції  
• важливих переговорів  
• угод  
• переїзду чи поїздки

    `,
    icon: LuCalendarHeart,
  },

  {
    id: "astro9",
    slug: "rectification",
    title: "Ректифікація",
    description: "Розрахунок точного часу народження",
    fullDescription: `
Ректифікація — це відновлення точного часу народження через важливі події вашого життя.
    `,
    icon: MdHistoryToggleOff,
  },
];
